{"CS120 - ORGA NIZACIJA RAČUN ARA\nSloj digitalne logike -\nSekvencijalna kola\nLekcija 04\nCS120 - ORGANIZACIJA RAČUNARA\nLekcija 04\nSLOJ DIGITALNE LOGIKE - SEKVENCIJALNA KOLA\nSloj digitalne logike - Sekvencijalna kola\nPoglavlje 1: Clock signal\nPoglavlje 2: Memorijska kola\nPoglavlje 3: Registri\nPoglavlje 4: RAM memorija\nPoglavlje 5: Stack i queue memorija\nPoglavlje 6: Pokazne Vežbe\nPoglavlje 7: Zadaci za samostalni rad\nPoglavlje 8: Domaći zadatak\nZaključak\nCopyright©2017–UNIVERZITETMETROPOLITAN,Beograd.Svapravazadržana.Bezprethodnepismenedozvole\nod strane Univerziteta METROPOLITAN zabranjena je reprodukcija, transfer, distribucija ili memorisanje nekog\ndela ili čitavih sadržaja ovog dokumenta., kopiranjem, snimanjem, elektronskim putem, skeniranjem ili na bilo\nkoji drugi način.\nCopyright © 2017 BELGRADE METROPOLITAN UNIVERSITY. All rights reserved. No part of this publication may\nbereproduced,storedinaretrievalsystemortransmittedinanyformorbyanymeans,electronic,mechanical,\nphotocopying, recording, scanning or otherwise, without the prior written permission of Belgrade Metropolitan\nUniversity.\nwww.metropolitan.ac.rs\nUvod\nUVOD\nUvod u lekciju #4\nU ovoj lekciji bilo je najpre biće predstavljena razlika između kombinatornih kola iz prethodne\nlekcije, i sekvencijalnih kola, čiji se trenutni izlaz računa ne samo u zavisnosti od trenutnih\nstanja na ulazu, već i od prethodnih izlaza.\nKao osnovno sekvencijalno kolo predstavljeno je SR-latch kolo, kao i D-flip-flip. Ova kola su\npogodna za skladištenje informacija, pa se koriste za realizaciju memorijskih i registarskih\nelemenata.\nUpravo zbog toga biće predstavljeni pomerački i brojački registri, kao i registri po modulu M.\nNakon toga, sledi objekat učenja o samoj RAM memoriji, i njene strukture i podele na SRAM i\nDRAM.\nKonačno biće reči o stack i queue memoriji, koje se uveliko koriste u različitim realizacijama.\nNa vežbama pokazana su kola koder/dekoder, multiplekser/demultiplekser, brojači, kao i\nmemorijski moduli.\n3\nPoglavlje 1\nClock signal\nODNOS IZMEĐU KOMBINACIONIH I SEKVENCIJALNIH\nKOLA\nPonašanje kombinacionog kola u potpunosti je specificirano\nistinitosnom tablicom ili skupom jednačina koje za svaku ulaznu\nkombinaciju daju odgovarajuću izlaznu kombinaciju.\nNa logičkom nivou digitalna kola se dele na dve velike klase: ona koja ne poseduju memoriju\nnazivamo kombinacionim kolima, dok su ona koja poseduju memoriju poznata pod imenom\nsekvencijalna kola. Ponašanje kombinacionog kola u potpunosti je specificirano istinitosnom\ntablicom ili skupom jednačina koje za svaku ulaznu kombinaciju daju odgovarajuću izlaznu\nkombinaciju. Ova kola preslikavaju ulazne podatke u izlazne, tj. obavljaju izračunavanje u\njednom koraku. U praksi postoji neznatno kašnjenje pre nego što izlazni signali promene\nsvoje stanje kao odziv na promene vrednosti signala na ulazu. Vreme odziva je obično\nveoma kratko, najčešće reda nanosekunde ili kraće, tako da se sa tog aspekta za odziv\nkombinacionih kola kaže da je trenutan.\nU idealnom slučaju, kombinaciono kolo se definiše kao kolo čije je vreme odziva nula. U": "Šta su kombinaciona kola u digitalnoj logici?|Kombinaciona kola u digitalnoj logici su ona koja ne poseduju memoriju i čije se ponašanje potpuno specificira istinitosnom tablicom ili skupom jednačina.\n\nKako se obavlja izračunavanje u kombinacionim kolima?|Izračunavanje u kombinacionim kolima se obavlja u jednom koraku, preslikavajući ulazne podatke u izlazne.\n\nKoja je karakteristika vremena odziva kombinacionih kola?|Vreme odziva kombinacionih kola je veoma kratko, reda nanosekunda ili kraće, pa se smatra da je odziv trenutan.\n\nStoje li kombinaciona kola u potpunosti definisana istinitosnom tablicom?|Da, kombinaciona kola su u potpunosti definisana istinitosnom tablicom ili skupom jednačina.\n\nŠta su sekvencijalna kola u digitalnoj logici?|Sekvencijalna kola u digitalnoj logici su ona koja poseduju memoriju i čiji se trenutni izlaz računa ne samo u zavisnosti od trenutnih stanja na ulazu, već i od prethodnih izlaza.\n\nKoji su primeri osnovnih sekvencijalnih kola?|Primeri osnovnih sekvencijalnih kola su SR-latch kolo i D-flip-flop.\n\nKako se koriste SR-latch kolo i D-flip-flop?|SR-latch kolo i D-flip-flop se koriste za skladištenje informacija i realizaciju memorijskih i registarskih elemenata.\n\nŠta su pomerački i brojački registri?|Pomerački i brojački registri su registri koji se koriste za realizaciju memorijskih i registarskih elemenata u digitalnoj logici.\n\nŠta predstavljaju RAM, SRAM i DRAM?|RAM je tip memorije koja se sastoji od SRAM i DRAM. SRAM je brži tip RAM memorije sa statičkim čuvarima, dok je DRAM sporiji tip sa dinamičkim čuvarima.\n\nŠta su stack i queue memorija?|Stack i queue memorija su strukture podataka koje se uveliko koriste u različitim realizacijama digitalne logike, omogućavajući pristup podacima na jednom kraju (stack) ili na oba kraja (queue).\n\nKoji su primeri kola koja su pokazana na vežbama?|Na vežbama su pokazana kola kao što su koder/dekoder, multiplekser/demultiplekser, brojači i memorijski moduli.", "opštem slučaju, ponašanje kombinacionog kola sa n ulaza koje koristi binarne signale se\nn\nmože opisati istinitosnom tablicom koja ima 2 vrsta, po jednu za svaku moguću ulaznu\nkombinaciju. Ilustracije radi, dvobitni sabirač sa slike 1 a ima četiri ulazna signala, a shodno\nprethodnom zaključku, njegov rad se opisuje istinitosnom tablicom koja ima 16 vrsta (slika 1\nb).\nDa bi opisali rad sabirača dva 16-bitna broja, kakve obično srećemo u praksi, potrebna je\n32\nistinitosna tablica koja ima astronomskih 2 = 4,294,967,296 vrsta. Imajući ovo u vidu,\nlogično se nameće potreba za efikasnijim opisom ponašanja kombinacionih kola. Dva moćna\nsredstva koja se koriste za ovu namenu su Bulova algebra i jezici za opis hardvera.\n4\nPoglavlje 1 Clock signal\nSlika 1.1 (a) Dvobitni sabirač i (b) njegova istinitosna tablica. [Izvor: Autor]\nPOJAM SEKVENCIJALNIH KOLA\nSekvencijalna kola moraju da pamte parcijalne rezultate između\nkoraka.\nNaime, digitalna kola koja izvršavaju specificirani zadatak obavljaju aktivnost kao sekvencu\nkoraka. Zbog toga za ova kola kažemo da su sekvencijalna. Ovakva kola sadrže memorijske\nelemente koji zadržavaju, tj. memorišu vrednosti logičkih signala. Kaže se da ukupni sadržaj\nsvih memorijskih elemenata u jednom sekvencijalnom kolu predstavlja stanje tog kola. Kada\nse promene vrednosti ulaza, kolo ili ostane u istom (tj. tekućem) stanju, ili promeni svoje\nstanje. Vremenom, kao posledica promena ulaza, kolo prolazi kroz sekvencu stanja. Kolo koja\nse ponašaju na ovaj način zovu se sekvencijalna kola (en. sequential digital circuits).\nSekvencijalna kola moraju da pamte parcijalne rezultate između koraka. Pojmovi\nsekvencijalno kolo i kolo koje poseduje memoriju predstavljaju sinonime.\nPrednost sekvencijalnog rada je ta što je za izvršenje svakog koraka potrebno ugraditi\njednostavniji hardver, ali sa druge strane, treba da protekne znatno duži period dok se ne\ndobije konačan rezultat.\nTo znači da implementacija nekog zadataka pomoću kombinacione logike rezultira kraćem\nvremenu generisanja rezultata u odnosu na implementaciju zasnovanu na sekvencijalnoj\nlogici, ali će zato obim hardvera biti veći.\nDa bi ukazali na kompromis između obima ugrađenog hardvera i brzine izračunavanja,\nanaliziraćemo primer sabiranja dva n-tobitna broja. Koristeći princip \"papira i olovke\"\nprimenićemovišekoračnimetodkodkogaseudatomtrenutkusabiraodgovarajućiparcifara,\npočev od cifre najmanje težine. Kada suma izračunata u tekućem koraku premaši vrednost\nnajveće cifre \"prenosimo jedinicu\" ka narednom paru cifara. To znači da je za sabiranje n\ncifarapotrebnasekvencaodnkoraka,pričemuseusvakomkorakucifraxiprvogbrojasabira\nsa po težini odgovarajućom cifrom yi drugog broja. Takođe, sumi se dodaje cifra prenosa\n(0 ili 1) koja je generisana u toku prethodnog koraka. Ilustracije radi, na slici 2 je prikazan\nsekvencijalninačinsabiranjabinarnihbrojeva.Kaoštosevidisaslike2a,usvakomkorakuse\nsabiraju tri bita, xi, yi i cul, gde je cul bit prenosa iz prethodnog koraka, i određuje bit sume zi i": "Šta su sekvencijalna kola?|Sekvencijalna kola su digitalna kola koja izvršavaju specificirani zadatak kao sekvencu koraka i sadrže memorijske elemente koji zadržavaju vrednosti logičkih signala.\n\nKako se opisuje rad kombinacionog kola sa n ulaza koje koristi binarne signale?|Rad kombinacionog kola sa n ulaza koje koristi binarne signale se opisuje istinitosnom tablicom koja ima 2 vrste za svaku moguću ulaznu kombinaciju.\n\nKoliko vrsta ima istinitosna tablica za dvobitni sabirač?|Istinitosna tablica za dvobitni sabirač ima 16 vrsta.\n\nKakav je problem sa opisivanjem ponašanja kombinacionih kola sa mnogim ulazima?|Problem je da je potrebna astronomski velika istinitosna tablica, pa se traže efikasniji načini opisivanja.\n\nKoja su dva sredstva za efikasniji opis ponašanja kombinacionih kola?|Dva sredstva su Bulova algebra i jezici za opis hardvera.\n\nŠta predstavlja stanje sekvencijalnog kola?|Stanje sekvencijalnog kola predstavlja ukupni sadržaj svih memorijskih elemenata u kolu.\n\nŠta je prednost sekvencijalnog rada?|Prednost je da je za izvršenje svakog koraka potrebno ugraditi jednostavniji hardver, ali prolazak kroz sekvencu stanja traje duže vreme.\n\nKoja je razlika između kombinacione i sekvencijalne logike po pitanju brzine i obima hardvera?|Kombinaciona logika rezultira kraćim vremenom generisanja rezultata, ali većim obimom hardvera u odnosu na sekvencijalnu logiku.\n\nKoliko koraka je potrebno za sabiranje dva n-tobitna broja koristeći sekvencijalnu metodu?|Potrebno je n koraka za sabiranje dva n-tobitna broja koristeći sekvencijalnu metodu.\n\nObjasni pojam \"prenosi jedinicu\" u sabiranju binarnih brojeva.|\"Prenosi jedinicu\" znači da se ako suma izračunata u tekućem koraku premaši vrednost najveće cifre, dodaje jedan na naredni par cifara.\n\nŠta predstavlja bit prenosa u sabiranju binarnih brojeva?|Bit prenosa je cifra (0 ili 1) koja se generiše u toku prethodnog koraka i dodaje se sumi u tekućem koraku.", "novibitprenosaciz.Naslici2b-dprikazanisukoracikodizračunavanja2+3=5(10+11=101).\n5\nPoglavlje 1 Clock signal\nSlika 1.2 Korišćenje sekvencijalnog sabirača za izračunavanje 2+3=5. [Izvor: Autor]\nSTRUKTURA I PODELA SEKVENCIJALNIH KOLA\nPrimarni izlazi se koriste za upravljanje radom okruženja kola dok se\nsekundarni izlazi koriste da specificiraju naredno stanje koje će se\npamtiti u memoriji.\nOdgovarajuća kombinacija sekundarnih ulaznih promenljivih u datom trenutku se naziva\ntrenutno stanje kola, dok su sekundarne promenljive poznate kao promenljive stanja.\nAko postoji m sekundarnih ulaznih promenljivih, tada sekvencijalno kolo može da se nađe u\nm\njednom od 2 različitih tekućih stanja. Izlazi kombinacionog dela kola se dele na dva skupa.\nPrimarni izlazi se koriste za upravljanje radom okruženja kola dok se sekundarni izlazi koriste\nda specificiraju naredno stanje koje će se pamtiti u memoriji. Broj sekundarnih izlaznih\npromenljivih zavisi od tipa memorije i korišćenog memorijskog elementa.\nPodela sekvencijalnih kola\nSekvencijalna logička kola se mogu podeliti na sinhrona (en. synchronous) i asinhrona (en.\nasynchronous).\nKod sinhronih kola interna stanja se menjaju u diskretnim vremenskim trenucima pod\nkontrolom impulsa za sinhronizaciju koga nazivamo taktni signal ili clock signal.\nTalasni oblik taktnog impulsa je obično pravougaoni (slika 3 ).\n\"ON\" vreme se definiše kao period dok je signal u stanju 1, a\"OFF\" vreme kao period dok je\nsignal u stanju 0.\nSlika 1.3 Taktni signal. [Izvor: Autor]\nTAKTNI PERIOD\nTaktni period je vremenski interval između dve uzastopne promene\ntaktnog signala u istom smeru, tj. između dve rastuće ili između dve\nopadajuće ivice taktnog signala.\nPrelazi stanja kod sinhronih sekvencijalnih kola se obično javljaju u trenutku kada postoje\nprelazi taktnih impulsa bilo sa 0 na 1 ili sa 1 na 0. Prelaz sa 0 na 1 se naziva pozitivna ivica\n6\nPoglavlje 1 Clock signal\nili usponska ivica, dok prelaz sa 1 na 0 odgovara negativnoj ili opadajućoj ivici taktnog\nsignala. Između sukcesivnih taktnih impulsa ne dolazi do promene informacije koja se čuva u\nmemoriji. Sinhrona sekvencijalna kola su takođe poznata i kao taktovana sekvencijalna kola.\nTaktni period je vremenski interval između dve uzastopne promene taktnog signala u istom\nsmeru, tj. između dve rastuće ili između dve opadajuće ivice taktnog signala (Slika 4 ).\nRecipročna vrednost taktnog perioda je taktna frekvencija. Širina taktnog impulsa je\nvreme u toku koga je vrednost taktnog signala jednaka 1.\nFaktor popune taktnog signala je količnik širine taktnog impulsa i taktnog perioda.\nKod asinhronih sekvencijalnih kola ne postoji spoljna sinhronizacija (taktni signal) tako da\nse prelazi kola sa jednog stanja u drugo iniciraju promenom primarnih ulaza. S obzirom da\nse promene stanja ne dešavaju u specificiranim vremenskim trenucima, asinhrona kola rade\nsopstvenom brzinom.\nSlika 1.4 Karakteristike taktnog signala. [Izvor: Autor]\n7\nPoglavlje 2\nMemorijska kola\nBISTABILANA KOLA\nU digitalnoj tehnici kao memorijski elementi koriste se bistabilana kola": "Šta se podrazumeva pod sekundarnim izlazima kod sekvencijalnih kola?|Sekundarni izlazi kod sekvencijalnih kola se koriste da specificiraju naredno stanje koje će se pamtiti u memoriji.\n\nKako se definiše trenutno stanje kola?|Trenutno stanje kola se definiše kao odgovarajuća kombinacija sekundarnih ulaznih promenljivih u datom trenutku.\n\nKoliko tekućih stanja može imati sekvencijalno kolo ako ima m sekundarnih ulaznih promenljivih?|Sekvencijalno kolo može da se nađe u m jednom od 2 različitih tekućih stanja ako ima m sekundarnih ulaznih promenljivih.\n\nKako se dele sekvencijalna logička kola?|Sekvencijalna logička kola se mogu podeliti na sinhrona i asinhrona.\n\nŠta kontrolise promene internih stanja kod sinhronih kola?|Promene internih stanja kod sinhronih kola se kontrolise taktnim signalom ili clock signalom.\n\nKako se definiše taktni period?|Taktni period se definiše kao vremenski interval između dve uzastopne promene taktnog signala u istom smeru.\n\nKada se obično javljaju prelazi stanja kod sinhronih sekvencijalnih kola?|Prelazi stanja kod sinhronih sekvencijalnih kola obično se javljaju u trenutku kada postoje prelazi taktnih impulsa.\n\nKako se nazivaju prelazi taktnih impulsa sa 0 na 1?|Prelazi taktnih impulsa sa 0 na 1 se nazivaju pozitivnim ili usponskim ivicama.\n\nŠta su bistabilna kola u digitalnoj tehnici?|U digitalnoj tehnici, bistabilna kola se koriste kao memorijski elementi.", "koja imaju dva stabilna stanja. Bistabilno kolo može da memoriše\ninformaciju od jednog bita.\nElement koji zadržava, tj. pamti uspostavljeno stanje i po prestanku dejstva pobudnih signala\nkoji su ih prouzrokovali, naziva se memorijski element. Osnovna karakteristika memorijskih\nelemenata jeste postojanje stabilnih stanja u kojima mogu ostati neograničeno vreme i koja\nse mogu menjati pod uticajem ulaznih signala.\nU digitalnoj tehnici kao memorijski elementi koriste se bistabilana kola koja imaju dva\nstabilna stanja. Bistabilno kolo može da memoriše informaciju od jednog bita. Dva osnovna\ntipa bistabilnih kola su: leč (en. latch) kola i flip‐flopovi (en. flip-flops).\nOva lekcija sadrži video materijal. Ukoliko želite da pogledate ovaj video morate da\notvorite LAMS lekciju.\nSR LATCH KOLO\nSR leč je najjednostavniji memorijski element koji se koristi za\nprojektovanje digitalnih sistema\nSRleč-SRlečjenajjednostavnijimemorijskielementkojisekoristizaprojektovanjedigitalnih\nsistema. SR leč čine dva unakrsno spregnuta NOR kola. Leč je logičko kolo memorijskog tipa\nsadvaizlazakojisukomplementarnijedanuodnosunadrugi.Osnovnilečsemožerealizovati\nunakrsnim povezivanjem dva NOR kola kako je to prikazano na slici 1 .\n8\nPoglavlje 2 Memorijska kola\nSlika 2.1 Leč kolo sa NOR logičkim kolima. [Izvor: Autor]\nUlazi leč kola se označavaju sa Set i Reset. U toku normalnog rada izlazi Q i Q su uvek\nkomplementarni jedan u odnosu na drugi. Usvojimo da su oba ulaza na 0, izlaz Q na 1 a Q na\n0. Izlaz kola G1 biće na 1, pa kako izlaz Q preko povratne grane pobuđuje ulaz kola G2, izlaz\nG2 biće 0. Kolo će zbog toga biti stabilno sa Q na 1 i Q na 0, kako smo i pretpostavili na\npočetku.AkosesadaResetulazpostavina1,izlazG1ćesepromenitina0.ObaulazakolaG2\nbiće na 0 tako da će se njegov izlaz promeniti na 1. Leč kolo će sada postati stabilno sa Q=0 i\nQ=1.\nPonašanje leč kola se može opisati istinitosnom tablicom datoj na slici 2 a. Ukršteni NOR je\npoznat kao SR (Set-Reset) leč. Logički simbol koji se koristi za predstavljanje SR leča prikazan\nje na slici 2 b.\nSlika 2.2 (a) Istinitosna tablica i (b) logički simbol SR leča. [Izvor: Autor]\nAnalizirajući istinitosnu tablicu sa slike 2a uočavamo sledeće. Ulazna kombinacija Set=1 i\nReset=1 nije dozvoljena, jer će oba izlaza Q i Q biti postavljena na 0, što je u kontradikciji sa\nuslovom da su Q i Q komplementarni.\nD LEČ\nLeč ima samo dva ulaza: D (Data - podaci) i C (Control - upravljački).\nJedan od načina da se eliminiše neželjeno nedefinisano stanje kod SR leča je da se obezbedi\nda ulazi S i R ne budu nikada istovremeno jednaki 1. Ovo se izvodi kod D leča kako je to\nprikazano na slici 3.\nLeč ima samo dva ulaza: D (en. Data ) ulaz za podatke i C (en. Control) upravljački ulaz.\n9\nPoglavlje 2 Memorijska kola\nSlika 2.3 D leč. [Izvor: Autor]\nKomplement ulaza D dovodi se preko NI kola na ulaz⎯S, a ulaz D preko invertora i NI kola na\nulaz⎯R. Sve dok je upravljački ulaz C=0 oba ulaza SR leča su na visoko i kolo ne može da\npromeni svoje stanje nezavisno od vrednosti D. Ulaz D se uzorkuje (odmerava) kada je C=1.": "Šta su memorijski elementi u digitalnoj tehnici?|Memorijski elementi u digitalnoj tehnici su elementi koji zadržavaju ili pamte uspostavljeno stanje i koji mogu da ostaju u stabilnim stanjima neograničeno vreme, koja se mogu menjati pod uticajem ulaznih signala. Bistabilna kola su primer memorijskih elemenata koja imaju dva stabilna stanja.\n\nKoje su osnovne karakteristike memorijskih elemenata?|Osnovne karakteristike memorijskih elemenata su postojanje stabilnih stanja u kojima mogu ostati neograničeno vreme i koja se mogu menjati pod uticajem ulaznih signala.\n\nŠta je SR latch kolo?|SR latch kolo je najjednostavniji memorijski element koji se koristi za projektovanje digitalnih sistema. Sastoji se od dva unakrsno spregnuta NOR kola i ima dva izlaza koji su komplementarni jedan u odnosu na drugi.\n\nKako se eliminiše neželjeno nedefinisano stanje kod SR latch kola?|Neželjeno nedefinisano stanje kod SR latch kola se eliminiše tako što se obezbedi da ulazi S i R nikada nisu istovremeno jednaki 1, što se izvodi kod D latch kola.\n\nŠta je D latch kolo?|D latch kolo je memorijski element koji ima samo dva ulaza: D (za podatke) i C (upravljački). Komplement ulaza D se dovodi preko NI kola na ulaz S, a ulaz D preko invertora i NI kola na ulaz R. Kada je upravljački ulaz C=0, latch ne može da promeni svoje stanje, dok se ulaz D uzorkuje kada je C=1.\n\nKoji su dva osnovna tipa bistabilnih kola?|Dva osnovna tipa bistabilnih kola su leč (latch) kola i flip-flopovi.\n\nŠta se podrazumeva pod \"stabilnim stanjima\" kod bistabilnih kola?|Stabilna stanja kod bistabilnih kola su stanja u kojima kolo može da ostane neograničeno vreme bez promene stanja, dok se mogu menjati pod uticajem ulaznih signala.\n\nObjasni pojam \"ulazi Set i Reset\" kod SR leč kola.|Ulazi Set i Reset kod SR leč kola su ulazi koji služe da se postavi ili resetuje stanje izlaza kola. Kada je ulaz Set postavljen na 1, izlaz Q se postavlja na 1, dok se izlaz Q' postavlja na 0. Kada je ulaz Reset postavljen na 1, izlaz Q se postavlja na 0, dok se izlaz Q' postavlja na 1.\n\nObjasni pojam \"ukršteni NOR\" kod SR leč kola.|Ukršteni NOR kod SR leč kola se odnosi na konfiguraciju dva NOR kola koja su povezana tako da izlaz jednog kola služi kao ulaz drugom kolu. Ova konfiguracija omogućava da SR leč kolo memorije informaciju o jednom bitu.", "AkojeD=1,Qsepostavljana1,tj.zakolokažemodajeustanjuset.KadajeD=0,izlazQ=0i\nkolo je u stanju reset. Logički simbol D leča prikazan je na slici.\nSR i D lečevi su sigurno najjednostavniji i najjevtiniji tipovi memorijskih elemenata koji se\nkoriste kod logičkih kola. Oni se koriste kao elementi za memorisanje (pamćenje) u kolima\ngde ne postoji direktna povratna veza sa izlaza bilo kog leča preko spoljnih kola na ulaze\nlečeva (u okviru leča postoje povratne veze). Ovaj zahtev je ispunjen kod strukture prikazane\nnaslici9.Kaoštosevidisaslike9,računarprihvatapodatkesaulaznoguređaja(tastatura),a\ngeneriše podatke na izlaznom uređaju (LED displej) koristeći lečeve. Svaka kolona lečeva ima\nzajedničku upravljačku liniju. Lečevi se koriste kao privremni memorijski elementi podataka\nna putu ulazni uređaj - računar ili računar - izlazni uređaj. Podatak se pamti u leč (lečuje) i\nostaje tamo sve dok ne naiđe novi podatak i zameni ga.\nFLIP-FLOPOVI\nFlip-flop se definiše kao bistabilno kolo koje koristi specijalni\nupravljački signal C (može i nekoliko takvih signala) radi specificiranja\ntrenutaka u kojima se memorija odaziva na promene.\nKaoštosmonapomenuli,zbogsvojetransparentnostiuradu(kadajeC=1,izlazQpratistanje\nna ulazu D) lečevi nisu pogodni za korišćenje kod sekvencijalnih kola koja imaju povratnu\nstrukturu, kao što je ona prikazana na slici 4, tj. kada se izlaz leča preko kombinacione logike\ndovodi na njegov ulaz. Naime, kada je C=1, izlazni signal (Q ili Q) se vraća preko povratne\ngranenaulazD.Neželjenekombinacijepropagacionogkašnjenja(kašnjenjasignalakrozkola)\nmogu da uzrokuju višestruke promene, što rezultira novom neodređenom stanju leča. Ovaj\nfenomen se naziva problem trke (en. race problem) i direktna je posledica transparentnosti\nleča koja omogućava da kada je C=1 (rad leča dozvoljen) kroz leč prođe neograničen broj\npromena podataka.\n10\nPoglavlje 2 Memorijska kola\nDa bi ograničili memorijski element na samo jednu promenu stanja po koraku kada je leču\ndozvoljen rad, neophodno je koristiti netransparentne memorijske elemente kao što su flip-\nflopovi.\nSlika 2.4 Tipičan način korišćenja lečeva kod računarskih ulazno/izlaznih kola. [Izvor: Autor]\nFlip-flopovi\nPosmatrajmo bistabilno memorijsko kolo ME koje ima ulaz(e) X, izlaz podataka Q i\nupravljački(e) ulaz(e) (takt) C. Broj ulaznih i upravljačkih linija, kao i način na koji se upravlja\nkolom, zavisi od tipa memorije. Kada je rad ME-u dozvoljen, prelaz iz jednog stabilnog stanja\nu drugo opisuje se relacijom na Slici 5.\nSlika 2.5 Relacija za ME kolo .[Izvor: Autor]\nIVIČNO OKIDANI D FLIP-FLOP\nStanje master leča koje treba kopirati je stanje koje je prisutno u\ntrenutku pojave pozitivne ivice taktnog impulsa.\nLogički dijagram D tipa flip-flopa koji se okida na prednju ivicu prikazan je na slici 6 . Flip-\nflop čine dve celine: master deo realizovan D lečom i slave deo koji može biti SR ili D leč.\nNa ulazu taktnog signala se dodaje invertor. S obzirom da je master leč D leč, flip-flop ima\nosobinu da se okida na ivicu, a ne na nivo kao što je to slučaj sa master-slave. Kada je C=0,": "Šta su osnovni memorijski elementi?|Osnovni memorijski elementi su SR i D lečevi.\n\nKada je D=1, šta se desava sa izlazom Q?|Kada je D=1, izlaz Q postavlja se na 1, tj. zaključava se u to stanje.\n\nŠta se dešava kada je D=0?|Kada je D=0, izlaz Q je 0 i kolo je u stanju reset.\n\nŠta je logički simbol D?|Logički simbol D je prikazan na slici i predstavlja ulazni signal za D leč.\n\nKada se koriste lečevi?|Lečevi se koriste kao elementi za memorisanje (pamćenje) u kolima gde ne postoji direktna povratna veza sa izlaza bilo kog leča preko spoljnih kola na ulaze lečeva.\n\nKako se koriste lečevi u računaru?|Računar prihvata podatke sa ulaznog uređaja (tastatura) i generiše podatke na izlaznom uređaju (LED displej) koristeći lečeve.\n\nŠta su flip-flopovi?|Flip-flopovi su bistabilna kola koja koriste specijalni upravljački signal radi specificiranja trenutaka u kojima se memorija odaziva na promene.\n\nZašto flip-flopovi nisu pogodni za korišćenje kod sekvencijalnih kola sa povratnom strukturom?|Zbog transparentnosti urada, kada je C=1, izlazni signal se vraća preko povratne grane na ulaz D, što može uzrokovati višestruke promene i problem trke.\n\nKako se ograničava memorijski element na samo jednu promenu stanja po koraku?|Koristeći netransparentne memorijske elemente kao što su flip-flopovi.\n\nŠta je master leča u D flip-flopu?|Master leča u D flip-flopu je realizovana D lečom i njeno stanje treba kopirati u slave leč.\n\nKada se okida D flip-flop koji se okida na ivicu?|D flip-flop koji se okida na ivicu okida se kada se pojavi pozitivna ivica taktnog impulsa.", "rad master leča je dozvoljen i transparentan, tj. njegov izlaz sledi stanje na D ulazu. Rad\nslave leča je zabranjen i on održava nepromenjeno stanje flip-flopa. Kada se javi pozitivna\nivica taktni ulaz se promeni na 1. Rad master leča se zabranjuje, njegov izlaz zamrzava,\na slave leču je dozvoljen rad tako da on kopira na svom izlazu stanje koje je prisutno\nna izlazu master leča. Stanje master leča koje treba kopirati je stanje koje je prisutno u\ntrenutku pojave pozitivne ivice taktnog impulsa. Zbog ovoga se ponašanje flip-flopa opisuje\nkaookidanjenaivicu.KadajeC=1,radmasterlečajezabranjenionnemožedasepromeni,\ntako da stanja oba leča (i master-a i slave-a) ostaju nepromenjena.\n11\nPoglavlje 2 Memorijska kola\nSlika 2.6 D tip flip-flopa koji se okida na pozitivnu ivicu. [Izvor: Autor]\nKonačno,kadaseCpromenisa1na0,radmaster-ajedozvoljeninjegovizlazpočinjedasledi\nvrednost na ulazu D. U toku prelaza sa 1 na 0 rad slave-a se zabranjuje tako da bilo kakva\npromenanamaster-unemaefektanaizlazslave-a.Zbogtoga,vrednostkojajememorisanau\nslave-u ostaje nepromenjena u toku ove promene. Kao što smo napomenuli, ivično okidani D\nflip-flop(ilidelayflip-flop)semožerealizovatiipomoćudvaDlečaijednoginvertora(slika7).\nOvo rešenje se uglavnom koristi kod logičkih kola koja pripadaju CMOS tehnologiji, kao što je\n74HC74. Flip-flopovi se obično projektuju sa jednim ili dva dodatna upravljačka ulaza koji su\nnamenjeni za inicijalizaciju početnog stanja flip-flopa. Upravljački signal koji dovodi flip-flop u\nstanje Q=0 se naziva clear (CLR’) ulaz, a onaj koji postavlja flip-flop u stanje Q=1 se naziva\npreset (PR’) ulaz. Uticaj PR’ i CLR’ upravljačkih signala je nezavisan od taktnog signala pa\nzbogtogazaPR’iCLR’kažemodasukaoulaziasinhroni.Nasuprotnjima,Djesinhroniulazu\nodnosu na taktni signal.\nSlika 2.7 D flip-flop koji se okida ivično. [Izvor: Autor]\nČETRI TIPA FLIP‐FLOPOVA SA ASINHRONIM\nULAZIMA\nČetri tipa flip‐flopova sa asinhronim ulazima su: (a) SR flip‐flop; (b) JK\nflip‐flop; (c) D flip‐flop; (d) T flip‐flop.\nSvaki flip‐flop je obično dostupan u dve varijante: sa ili bez ulaza za direktno (tj. asinhrono)\npostavljanje, koji se koriste za setovanje (ulaz SET) i resetovanje (ulaz CLR) flip‐flopa\nnezavisno od takta i ostalih ulaza. Ovi ulazi se koriste za postavljanje flip‐flopa u poznato\npočetno (tj. inicijalno) stanje. Na primer, stanje u koje će se flip‐flop spontano postaviti nakon\nšto je uključeno napajanje ne može se predvideti. Zato je neophodno da se pre početka\nnormalnog, sinhronog rada, flip‐flop postavi u odgovarajuće početno stanje posredstvom\nasinhronih ulaza. Ulazi SET i CLR se zovu asinhroni zato što ne zavise od taktnog signala i\nzbog toga imaju prioritet nad svim ostalim sinhronim ulazima.\nDrugim rečima, dok je asinhroni ulaz aktivan, vrednosti ostalih ulaza flip‐flopa se ignorišu.\n12\nPoglavlje 2 Memorijska kola\nDejstvo asinhronog ulaza počinje onog trenutka kada se na ulaz dovede aktivan naponski\nnivo (0 ili 1), i traje sve dok se ulaz ne deaktivira. Ako flip‐flop poseduje oba asinhrona ulaza,": "Šta je rad master leča kada je C=1?|Rad master leča je zabranjen kada je C=1, tako da stanja oba leča (i master-a i slave-a) ostaju nepromenjena.\n\nŠta je ivično okidani D flip-flop?|Ivično okidani D flip-flop je tip flip-flopa koga karakteriše promena stanja na pozitivnoj ivici taktnog impulsa.\n\nŠta su uticaji PR’ i CLR’ upravljačkih signala?|Uticaji PR’ i CLR’ upravljačkih signala su nezavisni od taktnog signala i nazivaju se asinhroni ulazi. Oni se koriste za inicijalizaciju početnog stanja flip-flopa.\n\nKoje su četiri vrste flip-flopova sa asinhronim ulazima?|Četiri vrste flip-flopova sa asinhronim ulazima su: (a) SR flip-flop; (b) JK flip-flop; (c) D flip-flop; (d) T flip-flop.\n\nŠta se dešava kada flip-flop poseduje oba asinhrona ulaza?|Ako flip-flop poseduje oba asinhrona ulaza, prioritet imaju oni, a vrednosti ostalih ulaza flip-flopa se ignorišu dok je asinhroni ulaz aktivan.\n\nObjasni pojam asinhroni ulazi u kontekstu flip-flopova.|Asinhroni ulazi u kontekstu flip-flopova su ulazi koji ne zavise od taktnog signala i imaju prioritet nad svim ostalim sinhronim ulazima. Oni se koriste za postavljanje flip-flopa u poznato početno stanje i nezavisno od ostalih ulaza.\n\nŠta se dešava sa stanjem slave leča kada se javi pozitivna ivica taktnog ulaza?|Kada se javi pozitivna ivica taktnog ulaza, stanje slave leča se promeni tako da kopira stanje koje je prisutno na izlazu master leča u trenutku pojave pozitivne ivice taktnog impulsa.\n\nObjasni pojam ivično okidanje u kontekstu flip-flopova.|Ivično okidanje u kontekstu flip-flopova je promena stanja flip-flopa na pozitivnoj ili negativnoj ivici taktnog signala. Ovo omogućava da se stanje flip-flopa menja samo u određenim trenucima, što je važno za sinhronizaciju sa ostalim delovima digitalnog kolaa.\n\nKada se koriste asinhroni ulazi SET i CLR?|Asinhroni ulazi SET i CLR se koriste za postavljanje flip-flopa u poznato početno stanje pre početka normalnog sinhronog rada. Oni se koriste kada je neophodno da se flip-flop postavi u određeno stanje nezavisno od taktnog signala i ostalih ulaza.", "SET i CLR, njihovo istovremeno dejstvo nije dozvoljeno. Na Sl. 24 su prikazani grafički simboli\nflip‐flopova sa ulazima za direktno postavljanje sa aktivnim niskom naponskim nivoom, što\nje naznačeno kružićima na odgovarajućim ulazima. Kod asinhronih ulaza sa aktivnim visokim\nnaponskim nivoom, kružići bi bili izostavljeni.\nSlika 2.8 Četri tipa flip‐flopova sa asinhronim ulazima: (a) SR flip‐flop; (b) JK flip‐flop; (c) D flip‐flop; (d)\nT flip‐flop [Izvor: Autor]\n13\nPoglavlje 3\nRegistri\nREGISTAR KAO MEMORIJSKA KOMPONENTA\nSinhronizovano sa aktivnom (rastućom ili opadajućom) ivicom taktnog\nsignala, u svaki flip‐flop upisuje se jedan bit informacije.\nRegistar (en. register) je memorijska komponenta koja se sastoji od n flip‐flopova sa\nzajedničkim taktnim signalom.\nSinhronizovano sa aktivnom (rastućom ili opadajućom) ivicom taktnog signala, u svaki\nflip‐flop upisuje se jedan bit informacije. U svom osnovnom obliku, pored taktnog signala,\nregistar ima n ulaza i n izlaza. Na Sl. 1 prikazan je primer 4‐bitnog registra. Grafički simbol\n4‐bitnogregistradatjenaSl.1(a),dokjenaSl.1(b)prikazananjegovaunutrašnjastruktura,\nkoju čine četiri paralelno povezana D flip‐flopa.\nSlika 3.1 4‐bitni registar: (a) grafički simbol; (b) unutrašnja struktura [Izvor: Autor]\nFunkcionalnost osnovne varijante registra, prikazane na Sl. 1, može se proširiti dodavanjem\nrazličitih upravljačkih signala.\nNa primer, ako registar treba biti resetovan ili setovan nezavisno od taktnog signala, bilo\npri uključenju napajanja, bilo pri pojavi nekih specifičnih događaja, mogu se dodati signali\nza asinhrono resetovanje i setovanje. Takvo jedno proširenje se postiže zamenom\njednostavnih flip‐flopova sa Sl. 1(b), flip‐flopovima sa ulazima za direktno postavljanje, kao\nšto je prikazano na Sl. 2(b).\nKao što se vidi na Sl. 2 , kratkotrajnim aktiviranjem signala Rst sadržaj registra se briše ili\nresetuje, tj. postavlja na “sve nule”. Slično, registar se setuje, tj. njegov sadržaj postaviti na\n“sve jedinice”, kratkotrajnim aktiviranjem signala Set. (S obzirom da je aktivni nivo signala\nRst i Set nizak, aktiviranje jednog od ova dva signala znači postavljanje 0 na odgovarajući\nulaz). Ulazi Rst i Set su nezavisni od taktnog signala i imaju prioritet nad njim. To znači da\nako je u trenutku pojave rastuće ivice taktnog signala, Set ili Rst jednak 0, ulaz I se ignoriše,\na registar se setuje, odnosno resetuje.\n14\nPoglavlje 3 Registri\nSlika 3.2 4‐bitni registar sa asinhronim resetovanjem i setovanjem: (a) grafički simbol; (b)\nunutrašnjastruktura. [Izvor: Autor]\nREGISTAR SA DOZVOLOM\nMultiplekseri se mogu iskoristiti i za pomeranje podatka zapamćenog u\nregistru. Ovakav tip registra se zove pomerački registar.\nKod obe varijante registra, prikazane na Sl. 1 i Sl. 2, novi podatak se automatski upisuje u\nregistar sa svakom rastućom ivicom takta. Međutim, kod mnogih digitalnih sistema, podatak\nkoji je upisan u registar ostaje u registru nekoliko taktnih ciklusa pre nego što se upiše\nnovi podatak. Iz tog razloga, mogućnost kontrole upisa predstavlja korisnu funkciju registra.": "Šta su SET i CLR?|SET i CLR su ulazi za direktno postavljanje stanja flip-flopova sa aktivnim niskim naponskim nivoom.\n\nŠta označavaju kružići na grafičkim simbolima flip-flopova?|Kružići označavaju ulaze za direktno postavljanje sa aktivnim niskim naponskim nivoom.\n\nŠta je registar?|Registar je memorijska komponenta koja se sastoji od n flip-flopova sa zajedničkim taktnim signalom.\n\nŠta se understaude pod sinhronizovano sa aktivnom ivicom taktnog signala?|Understaude se da u svaki flip-flop upisuje se jedan bit informacije u trenutku aktivne ivice taktnog signala.\n\nKako se može proširiti funkcionalnost osnovne varijante registra?|Funkcionalnost osnovne varijante registra se može proširiti dodavanjem različitih upravljačkih signala, poput signala za asinhrono resetovanje i setovanje.\n\nŠta se dešava kada je aktiviran signal Rst ili Set?|Kada je aktiviran signal Rst, sadržaj registra se briše ili resetuje na \"sve nule\". Kada je aktiviran signal Set, sadržaj registra se postavlja na \"sve jedinice\".\n\nŠta je pomerački registar?|Pomerački registar je tip registra koji se koristi za pomeranje podataka, a izrađuje se koristeći multiplekser.\n\nŠta je prednost kontrole upisa u registar?|Kontrola upisa predstavlja korisnu funkciju registra jer omogućava da podatak koji je upisan u registar ostane u registru nekoliko taktnih ciklusa pre nego što se upiše novi podatak.\n\nŠta su ulazi I, Rst i Set?|Ulazi I, Rst i Set su ulazi registra. Ulaz I je ulaz za podatke, dok su Rst i Set ulazi za resetovanje i setovanje registra.", "Kontrola upisa se postiže korišćenjem upravljačkog signala Enable (En) koji kada je 1\ndozvoljava upis novog podatka u registar.\nOvakav tip registra se zove registar sa dozvolom.\nNa slici 3 su prikazani grafički simbol, tabela operacija i unutrašnja struktura registar sa\ndozvolom. Registar sadrži multipleksere 2‐u‐1 koji omogućavaju izbor između ulaznog\npodatka i podatka koje je već u registru.\nSignalEnupravljamultiplekserimanatakavnačindakadajeEn=1,uregistarseupisujenovi,\ntj. ulazni podatak. U suprotnom, ako je En=0, podatak koji je prethodno upisan u registar se\nvraća na ulaze flip‐flopova i sa sledećom rastućom ivicom takta ponovo upisuje u registar ‐\ndakle, sadržaj registra ostaje neizmenjen.\nSlika 3.3 Registar sa dozvolom: (a) grafički simbol; (b) tabela operacija; (c) unutrašnja struktura.[Izvor:\nAutor]\n15\nPoglavlje 3 Registri\nPOMERAČKI REGISTAR\nPomerački registaa omogućava pomeranje upisanog sadržaja za jednu\nbit‐poziciju.\nPomerački registar\nNa primeru registra sa dozvolom pokazano je kako se postavljanjem multipleksera ispred\nulaza flipflopova može kontrolisati upis u registar. Sledeći sličnu logiku, multiplekseri se\nmogu iskoristiti i za pomeranje podatka zapamćenog u registru. Ovakav tip registra se\nzove pomerački registar i omogućava pomeranje upisanog sadržaja za jednu bit‐poziciju. U\nosnovnoj varijanti, pomerački registar poseduje upravljački signal Shift koji kada je jednak 1\npostavlja registar u režim pomeranja.\nNa slici 4 je prikazan primer 4‐bitnog pomeračkog registra.\nSlika 3.4 Četvorobitni pomerački registar sa serijskim ulazom i paralelnim izlazom: (a) grafički simbol;\n(b) tabela operacija; (c) unutrašnja struktura. [Izvor: Autor]\n16\nPoglavlje 4\nRAM memorija\nRAM (RANDOM‐ACCESS MEMORY, ILI MEMORIJA SA\nPROIZVOLJNIM PRISTUPOM)\nRAM memoriju čine: polje memorijskih ćelija, adresni dekoder i ulazno/\nizlazni (U/I) baferi.\nU prethodnom odeljku su registri, koji predstavljaju brzu memoriju malog kapaciteta pogodnu\nza privremeno čuvanje vrednosti promenljivih u toku nekog složenijeg izračunavanja.\nS druge strane, memorija sa proizvoljnim pristupom (en. Random‐access memory, RAM)\npredstavlja sporiju memoriju daleko većeg kapaciteta pogodnu za dugotrajno smeštanje\nprograma i podataka koji se koriste tokom izračunavanja. Slično registarskom fajlu, RAM je\nn\norganizovan u vidu polja od 2 vrsta sa m bita u svakoj vrsti.\nU opštem slučaju, n se kreće između 16 i 32, dok je m, obično 1, 4, 8, 16 ili 32. Tipična\nn\nmemorija nalikuje onoj sa Sl. 1 (a). S obzirom da memorija ima 2 vrsta, za jednoznačnu\nidentifikaciju svake vrste potrebno je n adresnih linija.\nPored adresnih linija, memorija poseduje ulazni signal Chip_select (CS) koji se koristi prilikom\nkonstrukcije većih memorija na bazi memorijskih čipova manjeg kapaciteta. Uvek kada je\nCS=1, memorija normalno funkcioniše.\nSlika 4.1 RAM memorija: (a) memorijske adrese i sadržaj; (b) grafički simboli. [Izvor: Autor]\nPREDSTAVLJANJE RAM MEMORIJE\nRAM memorija može se simbolički predstaviti kao struktura koju čine:": "Iz teksta kreirane Anki kartice na srpskom jeziku glase:\n\nŠta je kontrola upisa u registar?|Kontrola upisa u registar se postiže korišćenjem upravljačkog signala Enable (En) koji kada je 1 dozvoljava upis novog podatka u registar.\n\nŠta je registar sa dozvolom?|Registar sa dozvolom je tip registra koji koristi upravljački signal Enable za dozvoljavanje upisa novog podatka u registar.\n\nKako multiplekseri omogućavaju kontrolu upisa u registar sa dozvolom?|Multiplekseri omogućavaju izbor između ulaznog podatka i podatka koji je već u registru, tako da kada je Enable signala jednak 1, ulazni podatak upisuje se u registar.\n\nŠta je pomerački registar?|Pomerački registar je tip registra koji omogućava pomeranje upisanog sadržaja za jednu bit-poziciju.\n\nKako se pomeranje sadržaja kontrolise u pomeračkom registru?|Pomeranje sadržaja u pomeračkom registru kontrolise se upravljačkim signalom Shift. Kada je Shift jednak 1, registar se postavlja u režim pomeranja.\n\nŠta je RAM memorija?|RAM memorija (Random-Access Memory) je sporija memorija većeg kapaciteta pogodna za dugotrajno smeštanje programa i podataka koji se koriste tokom izračunavanja.\n\nKako je RAM memorija organizovana?|RAM memorija je organizovana u vidu polja od 2 vrste sa m bita u svakoj vrsti, sa n adresnih linija za jednoznačnu identifikaciju svake vrste.\n\nŠta je ulazni signal Chip_select u RAM memoriji?|Ulazni signal Chip_select u RAM memoriji se koristi prilikom konstrukcije većih memorija na bazi memorijskih čipova manjeg kapaciteta, i kada je CS=1, memorija normalno funkcioniše.", "taktovani D leč, jedno AND kolo i izlazni trostatički bafer.\n17\nPoglavlje 4 RAM memorija\nMeđutim, kada je CS=0, pristup memoriji radi čitanja ili upisa je onemogućen. Takođe,\nmemorijski čip ima još jednu upravljačku liniju, Read/write_select (RWS), koja bira jednu od\ndve memorijske operacije: upis ili čitanje. Kada je RWS=0, memorija čita svoj sadržaj sa\nlokacijeodređeneadresinimlinijamakojipostajedostupannaizlaznomportu.Sdrugestrane,\nkada je RWS=1, memorija upisuje sadržaj prisutan na ulaznom portu u lokaciju određenu\nadresnim linijama. RAM, takođe, ima m‐bitni ulazni i m‐bitni izlazni port. Za male vrednosti m\n(npr. 1 ili 4), memorija može imati razdvojene ulazne i izlazne portove.\nMeđutim, da bi se smanjio broj pinova na memorijskom čipu, ulazni i izlazni port su obično\nobjedinjeni u jedinstven ulazno/izlazni port. U opštem slučaju, broj pinova na čipu određuje\npovršnu koju čip zauzima na štampanoj ploči. Grafički simboli oba tipa pakovanja memorije\nsu prikazana na Sl. 1 (b).\nRAM memoriju čine: polje memorijskih ćelija, adresni dekoder i ulazno/izlazni (U/I) baferi.\nKao što je prikazano na Sl. 2 (a), memorijska ćelija (memory cell – MC) može se simbolički\npredstaviti kao struktura koju čine: taktovani D leč, jedno AND kolo i izlazni trostatički bafer.\nSlika 4.2 Organizacija RAM memorije: (a) memorijska ćelija; (b) unutrašnja struktura. [Izvor: Autor]\nSTATIČKI I DINAMIČKI RAM\nSRAM memorija čuva upisani sadržaj sve dok se ne upiše novi ili\nisključi napajanje.\nKada je signal Row_select jednak 1, bit informacije zapamćen u leču se prenosi na izlaz\nOutput. Ako je pri tom i signal Write_enable jednak 1, vrednost sa ulaza Input se pamti u\nleču. Uočimo da signal Write_enable služi kao signal takta za leč. Iako je memorijska ćelija\npredstavljena uz pomoć leča i dva gejta, treba razumeti da se ona realizuje sa daleko manjim\nbrojem tranzistora u odnosu na registarsku ćeliju.\nShodno načinu implementacije, memorije se dele na statički i dinamički RAM. Statički RAM\n(SRAM) se konstruiše na bazi memorijskih ćelija sa četiri do šest tranzistora kod kojih se\nleč realizuje uz pomoć unakrsno spregnutih invertora (2 tranzistora), dok se za AND kolo i\n18\nPoglavlje 4 RAM memorija\ntrostatički bafer koristi još po jedan tranzistor. SRAM memorija čuva upisani sadržaj sve dok\nse ne upiše novi ili isključi napajanje. S druge strane, kod dinamičke RAM memorije (DRAM),\nza realizaciju memorijske ćelije koristi se samo jedan tranzistor. Takva memorijska ćelija gubi\nupisani sadržaj pri svakom čitanju, te zbog toga nakon svakog čitanje mora da sledi upis\nupravo pročitanog podataka.\nTakođe, kao posledica nesavršenog postupka fabrikacije, sadržaj memorijske ćelije se\nspontanoinepovratnogubinakonizvesnogvremenapoupisu.Dabimemorijskaćelijauspela\nda sačuva svoj sadržaj, neophodno joj je pristupati sa nekom određenom frekvencijom, ili\nperiodično obnavljati (ili osvežavati) upisani sadržaj.\nU toku osvežavanja, operacije čitanja i upisa se suspenduju, što može u nekim slučajevima\nbiti problem. Međutim, bez obzira na sve to, zahvaljujući superiornim karakteristikama u": "Šta su dva tipa RAM memorije?|Statički RAM (SRAM) i dinamički RAM (DRAM)\n\nKako se sprečava pristup memoriji za čitanje ili upis kada je CS=0?|Pristup memoriji za čitanje ili upis se onemogućava kada je CS=0.\n\nŠta bira memorijska operaciju, upis ili čitanje, u RAM memoriji?|Upravljačka linija Read/write_select (RWS) bira memorijsku operaciju, upis ili čitanje.\n\nKada memorija čita svoj sadržaj?|Memorija čita svoj sadržaj sa lokacije određene adresnim linijama kada je RWS=0.\n\nKada memorija upisuje sadržaj?|Memorija upisuje sadržaj prisutan na ulaznom portu u lokaciju određenu adresnim linijama kada je RWS=1.\n\nKako se smanjuje broj pinova na memorijskom čipu?|Broj pinova na memorijskom čipu se smanjuje objedinjavanjem ulaznog i izlaznog porta u jedinstven ulazno/izlazni port.\n\nŠta čine statički RAM (SRAM) memorije?|Statički RAM (SRAM) memorije čine: polje memorijskih ćelija, adresni dekoder i ulazno/izlazni (U/I) baferi.\n\nKako se realizuje memorijska ćelija u SRAM memoriji?|Memorijska ćelija u SRAM memoriji se realizuje sa daleko manjim brojem tranzistora u odnosu na registarsku ćeliju.\n\nKada gubi upisani sadržaj dinamička RAM memorija (DRAM)?|Dinamička RAM memorija (DRAM) gubi upisani sadržaj pri svakom čitanju.\n\nZašto je neophodno periodično obnavljati upisani sadržaj u DRAM memoriji?|Neophodno je periodično obnavljati upisani sadržaj u DRAM memoriji zbog spontanog neprevratnog gubitka u vremenu pri pisanju.\n\nŠta se desava tokom osvežavanja DRAM memorije?|Tokom osvežavanja DRAM memorije, operacije čitanja i upisa se suspenduju.", "pogledu gustine pakovanja i cene, DRAM memorije se veoma često koriste za projektovanje\nnajrazličitijih elektronskih uređaja.\nS druge strane, SRAM memorije su, iako skuplje, brže i zbog toga pogodne za primene\nkoje ne zahtevaju veliku količinu memorije, kao i tamo gde brzi pristup memoriji predstavlja\nimperativni zahtev. SRAM i DRAM memorije su tzv. nepostojane memorije (en. volatile\nmemories), s obzirom da se njihov sadržaj gubi kada se isključi napajanje. S druge strane,\nROM i PROM memorije su tzv. postojane memorije, s obzirom da zadržavaju sadržaj čak i\nnakon isključenja napajanja.\nNa Sl. 2(b) je prikazan primer memorije 4x4 koja ima 16 memorijskih ćelija. Radi pristupa\nsvakoj memorijskoj ćeliji, adresni dekoder dekodira adresu i selektuje jednu od vrsta. Pri\ntome, ako su oba signala RWS i CS jednaka 1, u selektovanu vrstu upisuje se novi sadržaj.\nIako su sadržaji svih ćelija prisutni na izlaznim linijama, izlazni tro‐statički baferi su zakočeni\nšto omogućava novom podatku koji je prisutan na ulazno/izlaznom portu da bude upisan.\nMeđutim, ako je RWS=0 i CS=1, podatak iz selektovane vrste se kroz tro‐statičke bafere\nprosleđuje na U/I port.\nPROŠIRENJE MEMORIJSKE REČI\nProširenje memorijske reči, tj. formiranje memorije sa većim m, postiže\nse paralelnim vezivanjem nekoliko memorijskih čipova.\nn\nKao što je već rečeno, memorijske komponente se po pravilu proizvode u veličinama 2 xm,\ngde n i m mogu da variraju unutar širokog opsega brojeva. Međutim, uopšteno govoreći,\nn\nza konkretnu implementacionu tehnologiju i godinu proizvodnje, proizvod 2 xm, tj. kapacitet\nmemorije, jekonstanta. Imajući touvidu, uslučajevima kadamemorija potrebnogkapaciteta\nnije dostupna u vidu monolitnog čipa, ona se mora konstruisati pomoću memorijskih čipova\nmanjeg kapaciteta koji su dostupni na tržištu u vremenu projektovanja. U nastavku ovog\nodeljka biće opisano kao se realizuju “šire” i veće memorije, tj. kao postići da m i n budu veći\nod kapaciteta koji je raspoloživ na jednom memorijskom čipu.\nProširenje memorijske reči, tj. formiranje memorije sa većim m, postiže se paralelnim\nvezivanjem nekoliko memorijskih čipova. Na Sl. 3 je prikazan primer konstrukcije RAM\n19\nPoglavlje 4 RAM memorija\nmemorije kapaciteta 16Kx32 korišćenjem RAM čipova kapaciteta 16Kx8 (K je oznaka za kilo,\ntj. 210).\nSlika 4.3 16Kx32 RAM, realizovan pomoću 16Kx8 RAM. [Izvor: Autor]\nKao što se vidi, kod ovog rešenja, adresne linije, kao i linije CS i RWS, povezane su sa svim\nmemorijskim čipovima. Uočimo da su ulazna i izlazna magistrala podeljene na četiri grupe od\npo 8 linija, pri čemu su linije iz iste grupe povezane sa jednom memorijom. Korišćenjem ovog\npostupka u mogućnosti smo da konstruišemo memoriju bilo koje širine.\nDa bi smo realizovali veću memoriju, tj. memoriju sa većim brojem memorijskih lokacija,\nneophodno je povezati nekoliko memorijskih čipova na red, tako da svaki čip sadrži jedan\ndeo od ukupnog broja memorijskih reči. Princip rešenja prikazan je na Sl. 4 , gde je pomoću\nčetiri RAM čipa kapaciteta 16Kx8 realizovana RAM memorija kapaciteta 64Kx8. Uočimo da u": "Šta su DRAM memorije?|DRAM memorije su vrsta memorije koje se veoma često koriste za projektovanje najrazličitijih elektronskih uređaja zbog njihove niske cene i gustine pakovanja.\n\nŠta su SRAM memorije?|SRAM memorije su brže od DRAM memorija, ali su skuplje. Pogodne su za primene koje ne zahtevaju veliku količinu memorije i gde je brzi pristup memoriji imperativan zahtev.\n\nŠta su nepostojane memorije?|Nepostojane memorije su DRAM i SRAM memorije, koje gube svoj sadržaj kada se isključi napajanje.\n\nŠta su postojane memorije?|Postojane memorije su ROM i PROM memorije, koje zadržavaju sadržaj čak i nakon isključenja napajanja.\n\nKako se postiže proširenje memorijske reči?|Proširenje memorijske reči se postiže paralelnim vezivanjem nekoliko memorijskih čipova.\n\nKako se realizuju veće memorije?|Veće memorije se realizuju tako što se povezuju nekoliko memorijskih čipova na red, tako da svaki čip sadrži jedan deo od ukupnog broja memorijskih reči.\n\nObjašnji pojam 'adresni dekoder'.|Adresni dekoder dekodira adresu i selektuje jednu od vrsta radi pristupa svakoj memorijskoj ćeliji.\n\nŠta se dešava kada su RWS i CS jednaki 1 u selektovanoj vrsti?|Kada su RWS i CS jednaki 1 u selektovanoj vrsti, u selektovanu vrstu upisuje se novi sadržaj.\n\nŠta se dešava kada je RWS=0 i CS=1?|Kada je RWS=0 i CS=1, podatak iz selektovane vrste se prosleđuje na U/I port preko tro-statičkih bafera.\n\nObjašnji kako se formira memorija sa većim m.|Memorija sa većim m se formira paralelnim vezivanjem nekoliko memorijskih čipova.\n\nObjašnji kako se realizuje RAM memorija kapaciteta 16Kx32.|RAM memorija kapaciteta 16Kx32 se realizuje pomoću RAM čipova kapaciteta 16Kx8 putem paralelnog vezivanja nekoliko čipova i podeljivanja adresnih linija, linija CS i RWS, kao i ulazne i izlazne magistrale.", "ovom slučaju svi memorijski čipovi dele istu ulazne i istu izlaznu magistralu, kao i zajednički\nupravljački signal RWS.\n20\nPoglavlje 4 RAM memorija\nSlika 4.4 64Kx8 RAM realizovan pomoću 16Kx8 RAM. [Izvor: Autor]\n21\nPoglavlje 5\nStack i queue memorija\nSTACK MEMORIJA\nStek (stack) ili magacin je memorijska struktura koja se često koristi\nkako u softveru tako i u hardveru.\nStek\nStek (stack) ili magacin je memorijska struktura koja se često koristi kako u softveru tako\ni u hardveru. Po definiciji, stek je memorija sa ograničenim pristupom. Za razliku od RAM‐a\ngde se bilo kom zapamćenom podatku može pristupati u bilo kom vremenu, podacima\nzapamćenim u steku pristupa se isključivo preko jedne lokacije: vrh steka.\nDrugim rečima, kada se podatak upisuje u stek, ili stavlja na stek (operacije push), on se\nsmešta na vrh steka i pri tome se svi prethodno upisani podaci spuštaju za jednu poziciju niz\nstek.\nSuprotno tome, kada se podatak čita iz steka ili uzima sa steka (operacija pop), on se sklanja\nsa vrha steka i pri tome se svi ostali podaci podižu za jednu poziciju naviše uz stek. Na Sl. 1a\nje prikazan stek dubine 4 (tj. kapaciteta 4 reči) koji inicijalno sadrži dva broja: 34 na lokaciji\nTop i 23 na lokaciji Top‐1. Na Sl. 1b može se videti da stavljanje broja 45 na stek zahteva da\nbrojevi 34 i 23 budu premešteni na lokacije Top‐1 i Top‐2.\nS druge strane, kada se broj 45 uzima sa steka, brojevi 34 i 23 se pomeraju naviše, tako da\nponovo zauzimaju lokacije Top i Top‐1 (Sl. 1c). U ovom konkretnom primeru, na stek se može\nstaviti najviše četiri broja, pre nego što se stek napuni. Nakon toga, svaki novi upis u stek\nznači gubitak podatka sa dna steka.\nSlika 5.1 Rad steka: (a) sadržaj steka pre upisa broja 45; (b) sadržaj steka nakon upisa broj 45; (c)\nsadržaj steka nakon čitanja broja 45. [Izvor: Autor]\n22\nPoglavlje 5 Stack i queue memorija\nQUEUE MEMORIJA\nRed čekanja ili queue je struktura koja se često koristi kada treba\nuravnotežiti zahteve za nekom obradom.\nFIFO\nFIFO ( First‐In‐First‐Out), ili,red čekanja (en. queue), je struktura koja se često koristi kada\ntreba uravnotežiti zahteve za nekom obradom. Zamislimo, na primer, ljude kako stoje ispred\nšaltera u banci ili kako ulaze u autobus, koji moraju čekati u redu dok ne stignu na red da\nbudu opsluženi.\nSlična situacija se javlja kod različitih procesora, nekih integrisanih kola ili bilo kog uređaja\nkoji šalje podatke nekom drugom uređaju radi dalje obrade, u smislu da onda kada u jednom\ntrenutku brzina generisanja podataka nadmaši brzinu kojom se podaci obrađuju, neophodno\nje između proizvođača i potrošača umetnuti red čekanja, tj. FIFO.\nNaravno, u takvim situacijama, brzina kojom proizvođač generiše podatke ne može u\nnedogled biti veća od brzine kojom potrošač može da prihvata podatke, jer bi to zahtevalo\nred čekanja beskonačne dužine.\nSTACK NASPRAM QUEUE MEMORIJE\nStack naspram queue memorije (video objašnjenje)\nOva lekcija sadrži video materijal. Ukoliko želite da pogledate ovaj video morate da\notvorite LAMS lekciju.": "Stek šta predstavlja?|Stek (stack) je memorijska struktura sa ograničenim pristupom, koja se često koristi u softveru i hardveru. Podacima zapamćenim u steku pristupa se isključivo preko vrha steka.\n\nKako se podaci upisuju u stek?|Kada se podatak upisuje u stek (operacija push), on se smešta na vrh steka, a svi prethodno upisani podaci se spuštaju za jednu poziciju niz stek.\n\nKako se podaci čitaju iz steka?|Kada se podatak čita iz steka (operacija pop), on se sklanja sa vrha steka, a svi ostali podaci se podižu za jednu poziciju naviše uz stek.\n\nŠta je FIFO?|FIFO (First-In-First-Out) je struktura koja se često koristi kada treba uravnotežiti zahteve za nekom obradom. Prvi koji stigne čeka prvi biva opslužen.\n\nZa šta se koristi FIFO?|FIFO se koristi kada proizvođač generiše podatke brže nego što potrošač može da ih obrađuje, da bi se izbeglo preopterećenje potrošača.\n\nŠta predstavlja red čekanja ili queue?|Red čekanja ili queue je struktura koja se često koristi kada treba uravnotežiti zahteve za nekom obradom. Sličan je FIFO konceptu.\n\nKako se razlikuju stack i queue memorija?|Stack i queue memorija se razlikuju po načinu upisa i čitanja podataka. U stacku se podaci upisuju i čitaju isključivo sa vrha (LIFO), dok se u queueu podaci upisuju na kraj, a čitaju se sa početka (FIFO).", "23\nPoglavlje 6\nPokazne Vežbe\nKODER\nVežba iz kodera (10 min)\nKoder(en.coder)jekombinacionimodulsavišeulaza(m)ivišeizlaza(n).Onobavljafunkciju\nkodiranja informacija. Kada dovedemo signal na samo jedan ulaz modula, dobijamo izlaznu\ninformaciju u vidu binarnog koda sa (n) cifara.\nm\nKoder koji ima 2 ulaza ima m izlaza.\nSlika 6.1 Koder [Izvor: Autor]\nKoder 8/3\n3\nKoder 8/3 ima 8 (2 ) ulaza i 3 izlaza. Signal se može dovesti samo na jedan od ulaza. Kada\ndovedemo signal do određenog ulaza, na izlazu se generiše binarna kombinacija bitova koja\nodgovara broju ulaza. Npr. ako je signal na ulazu 3, dobijamo 011 na izlazu.\n24\nPoglavlje 6 Pokazne Vežbe\nSlika 6.2 Koder 8/3 [Izvor: Autor]\nREALIZACIJA KODERA\nRealizacija kodera preko logičkih elemenata (10 min)\nSlika 6.3 Koder realizovan uz pomoć ILI logičkih kola [Izvor: Autor]\n25\nPoglavlje 6 Pokazne Vežbe\nDEKODER\nVežba iz Dekodera (8 min)\nDekoder (en. decoder) je kombinacioni modul sa više ulaza (m) i više izlaza (n). On obavlja\nfunkciju dekodiranja binarno kodirane informacije koja je dovedena na ulaz. Na ulazu se\naktivira jedan ulaz koji odgovara ulaznoj kombinaciji brojeva.\nn\nDekoder koji ima n ulaza, ima 2 izlaza.\nSlika 6.4 Dekoder [Izvor: Autor]\nDekoder 3/8\n3\nDekoder 3/8 ima 3 ulaza i 8 (2 ) izlaza. Na ulaz se dovodi binarna kombinacija 3 bita. Kao\nizlaz se aktivira samo jedan izlaz koji odgovara toj binarnoj kombinaciji. Npr. ako je binarna\nkombinacija na ulazu 011, izlaz Y3 će se aktivirati.\n26\nPoglavlje 6 Pokazne Vežbe\nSlika 6.5 Dekoder 3/8 [Izvor: Autor]\nREALIZACIJA DEKODERA\nRealizacija dekodera preko logičkih elemenata (7 min)\nSlika 6.6 Realizacija dekodera uz pomoć AND i NOT logičkih kola [Izvor: Autor]\nMULTIPLEKSER I DEMULTIPLEKSER\nZadaci iz Multipleksera i Demultipleksera (10 min)\nMultiplekser (en. multiplexer, MUX) je kombinacioni modul koji ima (n) ulaza, (m) selekcionih\nsignala i jedan izlaz Y. U zavisnosti od binarne kombinacije selekcionog signala, on šalje\nn\nodređeni ulaz direktno na izlaz Y. Multiplekser za 2 ulaza mora da ima n selekcionih signala,\na uvek ima samo jedan izlaz.\nMultiplekser 8/1\n3\nMultiplekser 8/1 ima 8 (2 ) ulaza i 3 selekciona signala. Kada se na selekcione ulaze C2, C1 i\nC0dovedeodređenabinarnakombinacija,ulazkojiodgovaratojbinarnojkombinacijidirektno\nse prosleđuje na izlaz.\n27\nPoglavlje 6 Pokazne Vežbe\nSlika 6.7 Multiplekser [Izvor: Autor]\nDemultiplekser (en. demultiplexer, DMUX) je kombinacioni modul koji ima (n) izlaza, (m)\nselekcionih signala i jedan ulaz Y. U zavisnosti od binarne kombinacije selekcionih signala, on\nn\nšaljeulazYnanekiodizlaza.Demultiplekserza2 izlazamoradaimanselekcionihsignala,a\nuvek ima samo jedan ulaz.\nDemultiplekser 1/8\n3\nDemultiplekser 1/8 ima 8 (2 ) izlaza i 3 selekciona signala kao i jedan ulaz. Kada se na\nkontrolne signala C2, C1 i C0 dovede određena binarna kombinacija signal koji je na ulazu se\nšalje uzlazu koji odgovara binarnoj kombinaciji kontrolnih signala. Npr. ako se dovede na C2,\nC1 i C0 binarna kombinacija 101, ulaz Y će biti prosleđen na izlaz A5.": "Šta je koder?|Koder je kombinacioni modul sa više ulaza i više izlaza. On obavlja funkciju kodiranja informacija tako što doveden signal na samo jedan ulaz modula rezultuje u izlaznu informaciju u vidu binarnog koda sa (n) cifara.\n\nKako funkcioniše koder 8/3?|Koder 8/3 ima 8 (2^3) ulaza i 3 izlaza. Kada se signal dovede na određeni ulaz, na izlazu se generiše binarna kombinacija bitova koja odgovara broju ulaza.\n\nŠta je dekoder?|Dekoder je kombinacioni modul sa više ulaza i više izlaza. On obavlja funkciju dekodiranja binarno kodirane informacije koja je dovedena na ulaz.\n\nKako funkcioniše dekoder 3/8?|Dekoder 3/8 ima 3 ulaza i 8 (2^3) izlaza. Na ulaz se dovodi binarna kombinacija 3 bita. Kao izlaz se aktivira samo jedan izlaz koji odgovara toj binarnoj kombinaciji.\n\nŠta je multiplekser?|Multiplekser je kombinacioni modul koji ima (n) ulaza, (m) selekcionih signala i jedan izlaz Y. U zavisnosti od binarne kombinacije selekcionog signala, on šalje određeni ulaz direktno na izlaz Y.\n\nŠta je demultiplekser?|Demultiplekser je kombinacioni modul koji ima (n) izlaza, (m) selekcionih signala i jedan ulaz Y. U zavisnosti od binarne kombinacije selekcionih signala, on šalje ulaz Y na jedan od izlaza.\n\nKako funkcioniše multiplekser 8/1?|Multiplekser 8/1 ima 8 (2^3) ulaza i 3 selekciona signala. U zavisnosti od binarne kombinacije selekcionog signala, on šalje određeni ulaz direktno na izlaz.\n\nKako funkcioniše demultiplekser 1/8?|Demultiplekser 1/8 ima 8 (2^3) izlaza i 3 selekciona signala kao i jedan ulaz. U zavisnosti od binarne kombinacije kontrolnih signala, on šalje ulaz Y na jedan od izlaza.", "Slika 6.8 Demultiplekser [Izvor: Autor]\nPOTPUNI SABIRAČ I BROJAČ\nZadaci iz potpunog sabirača i brojača (10 min)\nPotpuni sabirač ima 3 ulazna signala. Dva ulazna signala (a i b) su brojevi koji se sabiraju, a\ntreći signal je prenos iz prethodnog sabiranja (Cul) (Carry In).\nPotpunisabiračima2izlaza,jedanjerezultatsabiranja,adrugisignalpredstavljaprenos(Ciz)\n(Carry Out).\n28\nPoglavlje 6 Pokazne Vežbe\nSlika 6.9 Potpuni jednobitni sabirač [Izvor: Autor]\nBrojači su sekvencijalni moduli koji nailaskom na takt daju binarni izlaz povećan ili smanjen u\nodnosunaprošlizajedanitouzavisnostidalijebrojačikrementalniilidekrementalni(rastući\nili opadajući).\nBroj različitih cifara koje brojač može da generiše nazivamo moduo brojača.\nBrojač po modulu M broji od 0 do M-1 nakon čega se resetuje i broji ponovo.\nSlika 6.10 Brojač [Izvor: Autor]\nBROJAČ PO MODULU 13\nZadatak: Brojač po modulu 13 (10 min)\n29\nPoglavlje 6 Pokazne Vežbe\nBrojač po modulu 13 broj od 0 do 12 pa se zatim resetuje. Pošto brojač broji do 13 treba nam\nbrojač sa 4 bita. Brojač počinje od 0000 (0) a resetuje se na takt posle 1100 (12).\nSlika 6.11 Brojač po modulu 13 [Izvor: Autor]\nPROŠIRENJE MEMORIJSKIH MODULA\nZadatak iz proširenja memorijskih modula 1/2 (15 minuta)\nZadatak 1. (15 minuta)\nDat je memorijski modul 16Kx8.\na) Skicirati modul.b) Koristeći date memorijske module i potrebna kola realizovati memorijski\nmodul 64Kx24\n30\nPoglavlje 6 Pokazne Vežbe\nSlika 6.12 Memorijski modul 16Kx8. I[Izvor: Autor]\nb) Proširenje: od modula 16Kx8, napraviti modul 64Kx24\nMoguća su sledeća proširenja:\n1. proširenje magistrale podataka (po horizontali) 2. proširenja adresnog prostora (po\nvertikali) 3. oba proširenja\nU ovom slučaju imamo oba proširenja\ndata proširenje: 8bita->24bita trebaju nam po 3 modula po horizontali\nadresno proširenje: 16K ->64K: trebaju nam 4 vertikalne grupe\nukupno nam treba 4x3=12 modula\nPrvo radimo proširenje po horizontali\nSlika 6.13 Proširenje po horizontali [Izvor: Autor]\n31\nPoglavlje 6 Pokazne Vežbe\nPROŠIRENJE MEMORIJSKIH MODULA - PROŠIRENJE\nPO VERTIKALI\nZadatak iz proširenja memorijskih modula, proširenje po vertikali\nZatim vršimo nad tim modulom proširenje po vertikali.\nZa proširenje od 16K na 64K, trebaju nam četiri vertikalne grupe, ali i obavezan dekoder, i to\ndekoder 2/4 u ovom slučaju. Obratite pažnju, na sve horizontalne grupe se vode niži bitovi\nadrese, od A0-A13, viši delovi adrese A14-A15 se vode na dekoder koji generiše četiri CS\nsignala za svaku vertikalnu grupu.\nSlika 6.14 Proširenje memorijskog modula po horizontali. [Izvor: Autor]\n32\nPoglavlje 7\nZadaci za samostalni rad\nZADACI ZA SAMOSTALNI RAD IZ KARNOOVIH MAPA\nZadaci za samostalni rad rade se ukupnp 120 minuta\nNa osnovu datih funkcija, uraditi minimalizaciju koristeći Karnoove mape, i zatim realizovati\nlogičku funkciju.\nf = P{0,1,2,3,8,13}\nf = P{0,3,4,6,7,8,9,15}\nf = P{1,3,5,7,9,11,13}\nf = P{1,2,3,6,7,8,14,15}\nf = P{1,3,4,7,8,9,10,12}\nf = P{0,2,4,6,13,14,15}\nf = Q{0,1,2,3,4,6,8,10}\nf = Q{0,3,4,6,12,13,14}\nf = Q{1,3,5,7,8,9,10,11}\nf = Q{1,2,3,6,7,10,11}": "Šta su osnovne karakteristike potpunog sabirača?|Potpuni sabirač ima 3 ulazna signala. Dva ulazna signala su brojevi koji se sabiraju, a treći signal je prenos iz prethodnog sabiranja. Potpunisabiračima ima 2 izlaza, jedan je rezultat sabiranja, a drugi signal predstavlja prenos.\n\nŠta predstavlja brojač?|Brojači su sekvencijalni moduli koji nailaskom na takt daju binarni izlaz povećan ili smanjen u odnosu na prošli izlaz i zavisnost od vrste brojača (krementalni ili dekrementalni).\n\nŠta je moduo brojača?|Broj različitih cifara koje brojač može da generiše nazivamo moduo brojača.\n\nKako brojač po modulu M radi?|Brojač po modulu M broji od 0 do M-1 nakon čega se resetuje i broji ponovo.\n\nŠta je dekoder 2/4?|Dekoder 2/4 je dekoder koji ima 2 ulazna signala i 4 izlazna signala, i služi za selekciju jednog od 4 izlaza u zavisnosti od ulaznih signala.\n\nKako da uradim minimalizaciju koristeći Karnoove mape?|Na osnovu datih funkcija, uradite minimalizaciju koristeći Karnoove mape tako što ćete svaku funkciju predstaviti u obliku Karnove mape, onda je spojiti i dobiti minimalnu logičku funkciju.", "f = Q{1,3,4,7,12,14,15}\nf = Q{0,2,4,6,8,10,12}\nDODATNI MATERIJALI\nDodatni materijali iz 4. lekcije\nKarnoove mape\nOva lekcija sadrži video materijal. Ukoliko želite da pogledate ovaj video morate da\notvorite LAMS lekciju.\nSR Latch | NOR and NAND SR Latch\nOva lekcija sadrži video materijal. Ukoliko želite da pogledate ovaj video morate da\notvorite LAMS lekciju.\n33\nPoglavlje 8\nDomaći zadatak\nDOMAĆI ZADATAK #4\nDomaći zadatak #4 okvirno se radi 45 min\nNapomena:\nSvaki student dobija jedinstveni domaći zadatak jer zavisi od broja indeksa.\n1. Realizovati modul brojača po modulu M. Moduo M računate tako što poslednju vrednost\nbroja indeksa pomnožite sa 2.\nStudenti kojima se indeksa završava na 0 ili 1 uzimaju predposlednju vrednost.\nPrimer:\n• Ako je broj indeksa 4087 onda treba projektovati sinhroni brojač po modulu 14.\n• Ako je broj indeksa 3960 onda treba projektovati sinhroni brojač po modulu 12.\nPočetno stanje brojača je 0.\nPredaja domaćeg zadatka:\nDomaći zadatak slati odgovarajućem predmetnom asistentu, sa predmetnim profesorom u\nCC.\nPredati domaći zadatak koristeći .doc/docx uputstvo dato u prvoj lekciji.\n34\nPoglavlje 9\nZaključak\nZAKLJUČAK\nRezime lekcije #4\nU ovoj lekciji bilo je reči najpre o sekvencijalnim kolima, čiji se trenutni izlaz računa ne samo\nu zavisnosti od trenutnih stanja na ulazu, već i od prethodnih izlaza.\nPredstavljena su latch kola i flip-flopovi, i predstavnici istih jesu SR-latch i D-flip-flip.\nOva kola su pogodna za skladištenje informacija, pa se koriste za realizaciju memorijskih i\nregistarskih elemenata.\nZatim, bilo je reči o stack i queue memoriji, koje se uveliko koriste u različitim realizacijama.\nLiteratura:\nA. Tanenbaum, Structured Computer Organization, Chapter 03, pp. 169 - 184.\n35": "Šta predstavljaju dodatni materijali u 4. lekciji?|Dodatni materijali u 4. lekciji su Karnoove mape i video materijal koji se može pogledati otvaranjem LAMS lekcije.\n\nŠta su SR Latch kola?|SR Latch kola su tip sekvencijalna kola koja mogu skladištiti jedan bit informacije.\n\nKako se modulo M računa za realizaciju modula brojača?|Modulo M se računa tako što se poslednja vrednost broja indeksa pomnoži sa 2.\n\nŠta predstavljaju flip-flopovi?|Flip-flopovi su tip sekvencijalnih kola koja mogu skladištiti jedan bit informacije i imaju sposobnost prelaska iz jednog stanja u drugo.\n\nKako se predaje domaći zadatak #4?|Domaći zadatak #4 se predaje odgovarajućem predmetnom asistentu sa predmetnim profesorom u CC koristeći .doc/docx format uputstva dato u prvoj lekciji.\n\nŠta su stack i queue memorija?|Stack i queue memorija su tipovi memorija koji se koriste za skladištenje informacija u određenom redu i imaju različite strategije za dodavanje i skidanje podataka.\n\nKoje je literature preporučena za ovo poglavlje?|Preporučena literatura za ovo poglavlje je knjiga A. Tanenbaum, Structured Computer Organization, Chapter 03, pp. 169 - 184."}